# CloudPoint Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CloudPoint Methods
CloudPoint Structure See Also
---
The CloudPoint type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equals | Indicates whether this instance and a specified object are equal. (Inherited from ValueType.) |
| GetHashCode | Returns the hash code for this instance. (Inherited from ValueType.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns the fully qualified type name of this instance. (Inherited from ValueType.) |

# See Also
CloudPoint Structure
Autodesk.Revit.DB.PointClouds Namespace